ETL/Catalogs/ОбъектыКВыгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ОбъектыКВыгрузке</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТаблицыSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФорматаSQL</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФорматаSQLНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыБазы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБазы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/ОбъектыКВыгрузке/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//***********************************************************************************************************
&НаСервере
Функция СохранитьНаСервере()
	
	Возврат Справочники.ОбъектыКВыгрузке.ПолучитьФайлФормата(РеквизитФормыВЗначение("Объект"));
	
КонецФункции
//***********************************************************************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаСохранить.Доступность = ЗначениеЗаполнено(Объект.ФайлФорматаSQLНаименование);
	
КонецПроцедуры
//***********************************************************************************************************
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(АдресФайла) Тогда 
		
		ТекущийОбъект.ФайлФорматаSQL = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СокрЛП(АдресФайла)));
		
	КонецЕсли;
	
КонецПроцедуры
//***********************************************************************************************************
&НаКлиенте
Процедура Сохранить(Команда)
	
	Данные = СохранитьНаСервере();
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогОткрытияФайла.Фильтр				 = "Произвольный (*." + Прав(Объект.ФайлФорматаSQLНаименование, 3) + ")|*." + Прав(Объект.ФайлФорматаSQLНаименование, 3);
	ДиалогОткрытияФайла.Заголовок			 = "Выберите файл";
	ДиалогОткрытияФайла.ПолноеИмяФайла		 = Объект.ФайлФорматаSQLНаименование;
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		Данные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		
	КонецЕсли;     
	
КонецПроцедуры
//***********************************************************************************************************
&НаСервере
Функция ПоискДублей(Значение)
	
	Для каждого СтрокаРезультата Из Объект.ТипыБазы Цикл
		Если СтрокаРезультата.ТипБазы = Значение Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Ложь;
			
КонецФункции
//***********************************************************************************************************
&НаКлиенте
Процедура ТипыБазыТипБазыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ПоискДублей(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,"Данный тип базы уже присутствует в списке",,"Ошибка");
	КонецЕсли;
	
КонецПроцедуры
//***********************************************************************************************************
